given
return
array
integer
number
n
1
two
one
0
string
integers
order
-
example
length
nums
following
x
0-indexed
may
note
minimum
2
answer
value
ith
maximum
k
sum
possible
equal
must
elements
first
true
binary
also
every
otherwise
positive
find
characters
3
values
strings
-1
left
represents
exactly
false
right
list
2d
ie
index
contains
element
empty
nodes
size
tree
times
time
make
least
int
j
row
numbers
representing
node
letters
sequence
valid
different
exists
operation
choose
result
character
words
multiple
b
7
unique
root
matrix
non-empty
column
arrays
consists
consisting
sorted
distinct
indices
represented
either
another
total
smallest
operations
want
type
adjacent
grid
digits
move
returns
three
without
initially
position
within
class
implement
numsi
contiguous
large
write
key
range
using
since
4
format
less
109
new
lowercase
modulo
starting
contain
name
arr
considered
containing
path
indicates
next
last
defined
largest
need
set
pair
5
inclusive
query
generated
start
table
substring
object
target
c
denotes
second
cell
remove
--
single
letter
initializes
even
subarray
original
english
end
means
function
sql
schema
take
form
greater
numbered
guaranteed
consecutive
test
called
difference
word
remaining
primary
edges
longest
get
input
allowed
rules
use
edge
cells
connected
change
cases
pairs
respectively
id
digit
reach
conditions
strictly
leading
design
needed
assume
non-negative
current
labeled
moves
always
amount
point
steps
four
distance
starts
perform
however
group
product
subsequence
could
answers
space
possibly
6
add
follows
score
numsj
used
deleting
whose
appear
step
many
game
graph
points
exist
1s
positions
represent
would
queries
replace
top
9
way
case
10
day
data
formed
ascending
zeros
linked
nums1
void
returned
answeri
algorithm
ai
zero
num
changing
rows
square
head
xi
edgesi
takes
resulting
pick
bi
0s
becomes
notice
formally
smaller
present
increasing
jth
varchar
person
output
structure
ends
ways
undirected
task
solution
appears
still
line
substrings
required
direction
turn
8
like
numslength
swap
performing
part
absolute
r
impossible
delete
nums2
place
final
let
types
including
subarrays
cost
determine
good
corresponding
yi
arri
removing
initial
price
search
split
common
null
moving
count
made
complete
representation
alice
along
equals
separated
call
none
lexicographically
non-decreasing
chosen
among
children
accepted
previous
consider
bottom
32-bit
directly
except
information
whether
palindrome
val
permutation
odd
z
already
groups
divide
satisfies
removed
process
height
decimal
become
people
occurs
spaces
according
convert
problem
shortest
alphabet
apply
p
go
obtained
reverse
level
optimally
divisible
average
define
queriesi
boolean
1-indexed
placed
prefix
playing
ordered
actual
long
uppercase
color
goal
occurrence
infinite
area
obtain
kth
unit
shown
city
fit
lower
child
subset
traversal
code
money
water
applying
coordinates
l
insert
together
bob
minutes
denoting
parent
leaf
added
pass
ones
special
negative
abc
turns
solve
occurrences
highest
subsequences
seconds
outside
board
ans
ab
wants
check
u
complexity
si
beginning
lengths
select
plane
trees
play
sort
construct
bitwise
never
forward
correct
corner
paths
side
described
duplicates
entire
lists
e
back
flip
written
concatenation
directions
squares
necessarily
extra
10-5
date
player
repeat
connecting
keys
derived
system
players
instead
travel
stones
interval
twice
bottom-right
duplicate
built-in
constraints
bits
currently
needs
frequency
100
divided
days
report
results
receive
parentheses
greatest
columns
simultaneously
replacing
rearrange
based
calls
employee
east
see
relative
follow
user
nth
visit
visited
tie
rectangle
larger
put
invalid
vertical
addition
top-left
ansi
random
suppose
describes
xor
inside
front
know
map
said
consist
denote
followed
subtree
calculate
starti
endi
s2
s1
item
full
functions
lowest
found
taken
divisor
arranged
exceed
expression
maximize
located
power
changed
create
11
trailing
minimize
partition
immediately
achieve
done
adds
stop
build
prices
stone
signed
units
division
per
assigned
choosing
upper
mat
weight
adding
removes
bit
sentence
standing
customer
road
filled
west
method
please
nums0
several
width
satisfy
arrlength
mentioned
third
buy
wall
certain
text
minimized
bst
meaning
maximized
ids
closest
vi
ui
clockwise
intervals
students
leftmost
assign
horizontal
wordsi
subtract
x-axis
north
south
employees
places
repeated
round
arr1
available
4-directionally
state
occur
land
reads
backward
names
costs
merge
1st
student
keep
run
include
robot
nums1i
moment
n-1
prime
diagonal
append
runs
location
fn
stops
concatenating
going
continue
longer
numsk
concatenated
arrj
non-overlapping
middle
friends
store
minute
finish
passed
12
increase
items
gets
floor
123
v
vertices
o1
modified
inputs
rotate
increment
belongs
jump
circle
ri
dictionary
match
vertically
specific
destination
fewer
inserted
pattern
rounded
palindromic
solutions
rule
examples
friend
might
share
foreign
users
pointsi
file
properties
additional
continuous
well
similarly
calculated
coordinate
sums
col
wins
colors
rest
walk
box
deleted
replaced
ending
around
circular
limit
2nd
belong
applied
asked
subsets
inserts
randomly
probability
counted
singly
h
due
seats
permutations
plus
sign
specifically
rectangular
w
reaches
25
nearest
encoded
win
assuming
differ
sequences
seat
performed
white
scores
directed
salary
alternating
x1
played
fits
sell
additionally
arr0
leave
3rd
events
matches
depth
center
constructed
horizontally
rotation
rotated
stack
later
supports
non-zero
company
rearranging
stock
repeating
speed
work
network
room
constant
transactions
num2
num1
subtrees
leaves
flips
covered
modify
rooted
lets
base
f
numsi1
remains
pointer
wait
changes
begin
pile
1000
queue
lefti
leetcode
anywhere
event
nothing
cycles
version
latest
reversed
customers
completely
open
say
lexicographical
created
stay
onto
hold
push
stream
cover
traveling
pricesi
image
meets
meet
request
winner
high
coins
much
word1
word2
ordering
dollars
pay
timei
26
similar
making
neighbors
products
15
etc
placing
uses
implementation
identical
tasks
condition
language
house
collect
x2
earliest
gridij
profit
higher
boxes
piece
decide
rounds
year
top-right
versa
vice
red
divides
costi
car
piles
righti
intervalsi
arithmetic
rightmost
intersection
program
five
multiply
capacity
card
cities
pricei
pop
taking
blue
finally
read
overlap
low
decrease
a2
shows
course
beautiful
serialization
evaluate
stored
insertion
included
mark
hour
indicating
andor
triplets
parts
converted
logs
swapping
accepts
operator
2n
colored
swaps
weights
queriesj
combination
combinations
houses
island
half
building
13
sides
transform
231
reorder
arbitrary
concatenate
brackets
suffix
90
degrees
-x
balanced
bottom-left
makes
vertex
enter
stonesi
particular
multiplication
rearranged
holds
olog
obstacle
nums2j
happens
bool
slength
explanation
querieslength
judge
vowel
broken
toi
fromi
ranges
contained
fully
radius
cards
axis-aligned
requirements
cardinal
21
previously
help
pushes
bidirectional
shape
manner
received
rotating
roads
country
enum
memory
come
arr2
productid
hours
0th
chessboard
modifying
in-place
denoted
surrounded
mapping
update
comes
expressions
evaluates
double
free
x-y
support
cycle
started
orders
abcde
street
y1
overlapping
running
message
arrive
world
01
descendant
able
ignored
zeroes
future
pieces
satisfied
repeatedly
userid
black
formatted
us
decided
rectangles
alices
321
answerlength
frequent
notes
evenly
1th
subsequent
4th
grouped
excluding
intersect
operators
remain
content
give
testcases
individually
abcd
c1
divisors
manager
bank
jumps
trip
drop
whole
parents
aa
happy
distribute
lie
flipping
trying
maximal
job
regardless
record
recall
reference
significant
sit
break
descendants
numeric
forming
others
mean
descending
runtime
draw
print
a1
courses
source
earlier
requests
completed
toward
best
inserting
walls
symbol
hand
earn
101
ci
triangle
absx
absi
equivalent
20
heights
picked
kind
cols
counts
parallel
chooses
mod
23
balls
g
affect
collection
loses
occupied
arguments
weighted
candies
exam
label
bag
indexed
towards
opposite
segment
composed
missing
independent
preorder
deletion
60
stores
tasksi
positioned
definition
cut
nums2i
answer0
answer1
sold
ancestor
equally
arrarrlength
associated
subtraction
timestamp
reached
rank
boundary
closed
block
compute
wrong
reset
marked
real
returning
replacement
custom
r1
sentences
team
goes
22
perfect
obstacles
wikipedia
far
cars
garden
perm
permi
sequentially
vowels
lines
writing
across
falls
simple
addint
30
works
pushint
visits
forms
outgoing
chunk
132
phone
variable
ensure
merged
1234
period
alternate
minimal
satisfying
endpoints
chose
computed
diagonally
tokens
converting
centered
q
puzzle
indicate
food
increases
figure
leaving
plant
shop
arrk
strs
unknown
shorter
checks
server
sitting
finished
away
passes
li
tile
sorting
factors
nice
positioni
-3
16
linear
paint
painted
shares
underlined
coin
selected
robots
tasked
y2
valuesi
generates
nodeval
secret
partitioned
allow
hi
weighti
labels
0000
series
removal
treat
sale
log
exact
answerj
quantity
limited
encoding
constructor
sets
hhmm
fill
straight
parenthesis
error
50
differs
pairsi
logsi
various
separate
roots
shift
property
lose
fall
choice
traverse
bi-directional
station
bus
waiting
resolve
symbols
capital
factor
nums1length
solutionint
blocked
unfortunately
causes
downward
increments
nested
expected
includes
accounts
reports
department
direct
frog
passengers
trips
reconstruct
attend
removals
19
components
neighboring
facing
wordslength
entries
small
happen
simplified
moved
procedure
104
meeting
decoded
movement
appended
fixed
window
median
periods
typed
sent
rating
counting
spend
sizes
prerequisites
connects
palindromes
internal
huge
multiplied
intermediate
environment
computer
connection
field
key-value
2s
disjoint
train
whenever
main
attack
lead
transaction
competition
face
010
complement
triplet
evaluation
consecutively
anagram
40
keeping
methods
servers
ball
standard
tiles
rowi
library
rooms
languages
supply
non-increasing
lost
gain
islands
collected
blocks
decreasing
milliseconds
ace
disturbing
wi
restaurant
age
social
website
persons
successful
alphanumeric
messages
provided
hello
bags
border
collide
amongst
simplicity
question
partitions
differences
pivot
month
neither
address
instance
00
deletions
forever
flowers
met
frequencies
chunks
doesnt
distances
-231
segments
splitting
guess
numsn
mathematical
strength
reduce
idi
determined
thus
instances
applies
eat
opening
access
likely
optimal
necessary
gives
idle
generate
maps
transformation
automatically
updates
criteria
coming
die
allows
uj
vj
allocate
topmost
conversion
existing
produce
roll
indirectly
unless
yj
copy
turned
green
unlimited
preceding
merging
interpreted
school
0-9
ki
sj
triple
cause
calendar
picks
aaa
skip
keeps
counterclockwise
diagonals
two-dimensional
quality
bad
api
threshold
135
inorder
hasnext
iterator
startpos
themself
display
kilometers
locations
i-th
endtimei
starttimei
boundaries
processed
printed
spell
yellow
gridrc
numsnumslength
lands
finding
dots
nums3
handle
via
proven
xth
beauty
remember
equation
therefore
pathsi
jsonparse
disconnected
encode
arrows
filling
appending
wordsj
root2
root1
234
keyboard
float
vali
indexi
overall
ugly
office
happened
varying
passing
summation
b2
component
arrangement
27
status
rate
banned
refer
besides
attributes
serialized
signifies
public
speedi
buffer
numerical
star
valsi
objects
dist
tests
05
traveled
liters
queens
s3
postorder
section
clear
xs
nums2length
mapped
getint
specified
enough
partitioning
representations
f1
discount
considering
calculation
recover
sub
matching
distancei
track
receives
i1th
c2
treated
y-axis
updated
dates
desired
unlock
named
customerid
command
separating
hamming
perimeter
aj
numsleft
numsright
candidates
else
shapes
records
parenti
furthermore
reaching
buying
instantaneously
denominations
alphabetical
vice-versa
numi
assigning
buildings
011
send
media
balance
account
grow
resulti
0100
interested
starttime
endtime
decode
14
eats
matrixs
belonging
pi
p1
look
questions
undefined
better
floors
dashes
constructs
teams
fourth
flower
planted
reachable
nine
repetition
begins
activity
token
unable
slots
outer
generator
yields
indicesi
alphabetically
balloon
engage
parameter
finds
jobs
neighbor
reformat
restrictions
productname
shuffled
infected
xy
sk
roadsi
local
legal
paper
candy
emails
email
close
relationship
mountain
jumping
accept
leetcodecom
bitwise-xor
insertint
ever
xy-plane
origin
-2
hidden
acyclic
2359
magic
arrives
arrival
finishes
trivially
constraint
night
aba
formula
knows
500
seven
quantities
eating
apple
n-ary
nary-tree
statement
executed
endpoint
aforementioned
cant
strange
paired
unoccupied
bobs
colorsi
fraction
respective
recursive
rectanglesi
dot
participating
recent
workers
worker
passenger
appeared
domain
repeats
resultant
pointers
walking
folder
matter
dice
rolls
games
login
machine
connections
usual
ignoring
describe
anagrams
paid
ratio
inclusively
calling
details
employeeid
coli
24-hour
valuei
gcdx
erasing
script
cuts
xj
composition
root-to-leaf
shifts
pilesi
numsl
journey
tank
route
stations
determines
reading
grid00
gridm
1n
causing
libraries
hash
105
bc
cd
diagram
lies
context
flattened
judged
res
flatten
managers
managerid
avoid
obstaclesi
ranging
calculator
startvalue
drive
rangesi
eventsi
comprise
precedence
wordlist
checked
beyond
widths
corresponds
afterward
numsk-1
actions
2-d
pref
positionsi
dropped
x-coordinate
tallest
aligned
diff
searchword
singly-linked
behind
erase
stacks
forgot
reuse
graphi
lodashs
splits
pushed
stand
knight
chess
stick
link
effect
whereas
coefficient
imagine
sliding
targetsum
daily
bar
typei
a0
an-1
slices
prerequisitesi
numcourses
64-bit
container
heighti
28
title
photo
inputoutput
notation
calculations
deserialized
deserialize
restriction
matij
subgraph
vals
contrast
ride
disti
fuel
truck
liter
transferred
corners
eventually
counter
parser
queen
configuration
placement
assert
expectednumslength
expectednums
expectednumsi
assertions
seq
feed
buckets
restricted
entering
nobody
regions
region
occupies
labelled
putint
river
plants
list2
list1
itemsi
colori
selecting
evaluating
fibonacci
32
retrieves
1101
left-to-right
heightsi
matrices
r2
falling
implemented
double-ended
normal
simulate
deque
depending
occurring
dollar
yyyy-mm-dd
flipped
uniquely
unlocks
locked
force
baskets
basket
well-formed
sub-array
bought
weightsi
frequently
non-space
known
unsigned
ingredients
cj
xn
calculates
domino
net
anything
assumed
painting
online
blank
recursively
destroyed
connect
maxsum
aec
5th
collecting
execute
solving
dont
manhattan
candiesi
1-based
absnumsi
comprises
17
planning
maximizes
enters
distribution
distributions
relations
infinitely
p2
gcd
occupy
teacher
alphabetic
listed
parentsi
callback
interface
drawing
255
upper-case
addresses
mouse
arrleftright
001
abcc
travels
bloom
sn
plots
violating
1-9
partially
listinteger
59
tweets
tweet
marks
freely
lock
losing
press
video
unsorted
finishing
initialized
minus
balloons
bounds
str2
n2
str1
max
contents
six
difficulty
enhances
0-based
unary
24
arrange
individual
built
existed
respect
sales
held
counter-clockwise
adjacency
spread
graphij
compressed
action
averages
critical
12345
unchanged
acb
closing
monotone
touching
loss
mini
income
amounti
continues
sometimes
successive
euclidean
axes
quadruplets
entirely
ancestors
clock
zigzag
spiral
swapped
regular
partial
salaries
312
contact
rob
police
alerting
join
numerals
principle
show
percentage
i0
cutting
uncommon
eaten
compare
mm
elevation
completes
thrown
throws
ij
bbb
selling
chars
tournament
actually
password
cpu
execution
tells
tell
110
asks
fractional
denominator
instantly
provide
fruits
decrement
sub-arrays
ranking
ties
assignment
working
kinds
pyramid
getrandom
iterates
formats
possibilities
departmentid
departments
fair
6-sided
crosses
truncate
whitespace
factory
logged
device
buses
submatrices
chain
touches
connectionsi
driving
catch
members
member
allocated
wrapping
shifting
ability
ranks
info
orderdate
height-balanced
xi1
solved
75
picking
duration
compared
fx
bracket
directory
rearrangement
poor
pairings
coprime
tuples
indexing
temperature
backwards
security
stashed
robber
bsts
structurally
owner
degree
fnarri
reminder
climb
shuffling
shared
meetings
filetxt
prerequisite
profiti
try
cross
phrase
folders
edgesj
staircase
amounts
exceeds
magical
invert
terms
files
deletes
pointing
arr2j
arr1i
variables
numsr
lexicographic
gas
02
exceeding
personid
promise
promises
bars
forth
instructed
trimmed
trim
cookies
awesome
intersecting
tries
bookint
booking
half-open
implementing
removekey
bacd
modifies
abcba
sleftirighti
linked-lists
ahead
correctly
heads
snake
spans
downwards
correspond
345
initialize
2h
tripsi
drives
startdayi
enddayi
cousins
reduced
init
distributing
drawn
circumference
cheapest
spellchecker
converts
case-sensitive
capitalization
categories
spelling
operates
case-insensitive
mines
pixels
stopped
wide
worth
designed
page
independently
landing
leftright
dropping
matched
layer
performance
layers
45
situation
short
faster
80
searchint
reordered
favorite
copies
realized
solvable
json
popped
movements
dial
pad
ch
cipher
fashion
row-wise
arrow
y-coordinate
powers
3x
overlapped
history
sequential
movies
movie
odd-numbered
cinema
cream
summer
boy
ice
costsi
traversed
an-2
entry
entered
empid
slice
anti-clockwise
3n
pizza
permitted
maxtime
differing
fee
b1
excel
sheet
partner
yes
dividing
driver
taxi
boomerang
proper
sub-grids
quad-tree
bottomright
terminator
isleaf
topleft
sub-grid
bottomleft
topright
wiki
recurse
engineer
speeds
truncates
computing
reconstructed
serializationdeserialization
serialize
transmitted
73
graphs
index2
index1
modification
210
012
addnumint
floating-point
laser
n-queens
-10
len
definitely
things
kept
removeduplicatesnums
important
nums1j
transactionsi
quotation
quote
slash
fed
bucket
visiting
training
decreases
opponents
energy
experience
sections
shot
captured
capture
os
nums2i2
34
33
ten
extract
subgrid
covers
describing
refill
watering
plantsi
manages
non-leaf
deepest
consistent
f0
appends
everybody
t1
t2
ansj
erased
images
borders
holding
brings
countint
supported
natively
peekpop
carpetlen
tilesi
223
natural
single-space
hands
hexadecimal
pre-order
worddict
segmentation
reused
roomsi
package
packages
port
ship
identified
bb
xxxx
incremented
invalidate
recently
cache
java
compiler
bj
numarray
numarrayint
sumrangeint
linked-list
powx
duplicated
choices
mutate
housesi
yet
costij
revealed
mine
unrevealed
minimizes
smash
cherries
halves
242
4237214
274
ticket
tickets
cancel
sends
collects
incoming
withdraw
transfers
transfer
deposit
depositint
withdrawint
cartesian
keysi
computers
processes
totally
18
excluded
06
carries
carry
peoplei
simulates
groupi
collision
collisions
collides
staying
stationary
testing
shouldnt
uniform
2510
121241510
numsnumslength-1
fleet
one-lane
meters
fs
foods
throughout
afterwards
delay
non-intersecting
family
genetic
parents0
90-degree
optional
gains
memoized
cached
factorial
numsn-1
numsk1
k2
k1
19216811
ip
shifta
walked
cat
immediate
words2
words1
queryint
arrived
miles
stays
planting
worked
seed
sure
sudoku
sub-boxes
instruction
executing
startrow
startcol
instructions
monitor
10000
recorded
120
attribute
doubly
a-b
punctuation
turning
slot
dead
displays
lakes
potentially
requires
metal
keyi
button
align
ring
reversing
k-1
relation
i2
session
fn-1
videos
burst
bursting
forest
charged
maintain
master
guessed
guesses
strategy
majority
efficiently
peak
outcome
asteroids
asteroid
1337
strengths
kingdom
weakest
dash
reformatted
restrictionsi
ratingi
restaurants
filter
filtering
maxdistance
456
fi
fibonacci-like
communicate
refers
numerically
saleid
-9
uniformly
resources
projects
project
malware
minitial
equations
equationsi
ccc
compress
marking
run-length
extended
ascii
conflict
gap
parameters
citations
citationsi
researcher
published
researchers
cited
papers
h-index
likes
doctors
bulbs
originally
optimize
matrixij
resets
attempt
maxi
tab
url
distributed
attempts
eight
arriving
4567012
0124567
in-order
eee
extension
applications
2th
numrows
pascals
squared
indexes
numsa
numsd
numsb
numsc
unrooted
lying
encodedi
proved
dag
app
followerid
digitsi
rooks
bishops
rook
attacking
bishop
customersi
till
chef
arrivali
preparing
dimensions
non-equal
1010
transformed
eval
tweetid
spanning
cab
defines
convenience
biginteger
smart
entrance
ended
ba
cde
dominoes
rotations
delivery
service
cyclic
900
xxvii
roman
xii
simply
iiii
ii
usually
ix
iv
400
numeral
xx
rides
percent
cook
ik
i1
numsik
prepending
col1
row2
row1
col2
diameter
rotten
apples
farthest
lucky
compact
endword
beginword
trap
raining
volume
wish
cancelled
reject
resolved
throw
yield
const
boardrc
success
cooldown
preserved
signs
gold
absent
late
attendance
award
eligible
subjected
advance
advances
weak
strong
exclusive
single-threaded
population
birth
years
death
reply
processing
stopping
findint
supposed
tails
pos
internally
continuously
fruit
reduces
multi-dimensional
bijection
235
worst
tracks
ranked
stonevalue
tied
votes
systems
installing
flood
frame
past
fulfilled
buttons
layout
farmland
plot
inverse
removeint
maxsize
nums0i
obeys
requirement
a3
term
102
install
non-digit
printer
curr
sea
vote
timesi
aeb
aebdc
performs
1d
2-dimensional
creating
peek
exchange
tower
viewing
cubes
valued
preserving
infinity
eventdate
logging
deviceid
someday
playerid
gamesplayed
everyone
completing
flowersi
gardens
incomplete
pid
designated
submatrix
movesi
x3
newnums
newnumsi
triangular
targets
rain
unbroken
breaks
egg
certainty
eggs
decki
deck
optionally
108
primes
aab
s1i
decrements
floating
permute
orderid
sellerid
2019
buyerid
speciali
offers
super
guarantee
xi2
skipped
ideal
f2
025
someone
serve
glass
hire
f3
bound
joined
rootval
dies
successor
king
million
ty
tx
sy
sx
hits
shaped
allotted
directories
filedirectory
sensitive
handling
colj
rowj
gridrowicoli
pairing
preferred
hh
widthi
stacked
attending
answersi
song
timej
songs
market
installed
rx
machines
alength
temperatures
reporting
related
startj
cellsi
guarded
upon
drops
rightward
involving
puts
pressed
professional
tonight
capacities
namesi
lca
identify
non
expansion
e1
e2
latter
former
spreads
gone
triangles
ignore
repaired
ranksi
repair
concept
ladder
youre
divisibility
warehouse
x0
sticks
wooden
rational
gcdnumsi
rollsi
warm
limitj
tic-tac-toe
disconnect
fruitsi
produces
pointslength
mixed
sake
half-closed
traversing
levels
classes
contaminated
labelsi
meetingsi
mode
uninfected
cups
cup
liquid
quarter
importance
bricks
disappear
brick
-k
transpose
indirect
soldiers
1001
interfere
sourcei
requestsi
big
p0
retrieve
insertstring
separation
numsindex
unused
6th
lower-case
frogs
space-separated
js
leftover
safe
boxesi
ycenter
xcenter
bash
spreading
week
rented
lined
subordinates
bug
seatsi
cheese
movecost
pushing
chalkboard
groupsi
party
forwards
node2
node1
getting
2x
guards
parent0
locks
home
searches
coinsi
patterns
bac
triples
2i
datetime
v1
v2
sunday
tuesday
monday
delayed
multiplicity
cloned
asynchronous
rear
isempty
programming
fifo
isfull
treenode
abbreviated
iteration
abcdefghijklmnopqrstuvwxyz
typing
news
relationships
limits
fresh
penalty
2020
stamps
gridi
struct
populate
innermost
chocolates
213
arr2length
arr1length
rests
batch
updateint
incorrect
obj
selection
180
pairwise
stocks
protected
evaluated
uncolored
deep
pig
booleanvalue
filtered
companys
nextint
listnode
obtaining
expressed
mail
gridrowcol
shiftsi
vyz
abcdefuvwxyz
bef
live
numsl1
numsr-1
faces
answerij
matrc
signals
traffic
signal
gasi
circuit
additive
03
turnn
personname
kilograms
turn1
promise1
promise2
math
submitted
eg
elementary
grade
rewarded
352
progression
capitals
usage
usa
google
kith
trimi
greed
gi
cookie
insufficient
successfully
mycalendartwo
myhashset
containskey
hashset
addkey
pickint
010221
330120031032041
baab
queries4
abba
lyb
abcda
truefalsefalsetruetrue
queries2
falsetrue
queries0
queries1
queries3
palidrome
headb
heada
retain
skipa
intersectval
skipb
intersected
listb
lista
n-2
nn
horizontalvertical
one-bit
numsinumslength
159
numsii
357
sentencesi
versions
isbadversionversion
developed
fails
develop
side-length
444
nestediterator
pseudocode
tested
nestediteratorlistnestedinteger
nestedlist
iteratorhasnext
iteratornext
endpos
wealth
richest
accountsij
lanes
obstacles2
lane
numpassengersi
vehicle
taps
watered
tap
one-dimensional
333
457
targetlength
stamped
left-most
stamp
baa
ac
ababbc
abcbabcbcb
reducer
arrayreduce
fnval
fninit
incompatibility
incompatibilities
circles
circlesi
lattice
edits
edit
backs
fronts
frontsi
backsi
src
flights
flight
dst
flightsi
errors
yeellow
capitlization
checker
mistakes
yollow
yllw
handles
relevant
minesi
arms
gridxiyi
result1
widths1
result0
widths0
13024
24130
efabcd
abefcd
cdefab
cdabef
efcdab
acdbef
abcdef
developer
pages
web
ghostsi
integral
ytarget
ghost
xtarget
escape
ghosts
pac-man
multiplicand
k-distant
brushing
freezes
sidelengthi
landed
exchanges
10101
diffij
onesrowi
onescolj
zerosrowi
zeroscolj
worddictionary
worddictionarysearchpad
wordlength
worddictionaryaddwordaddwordaddwordsearchsearchsearchsearch
worddictionaryaddwordmad
nullnullnullnullfalsetruetruetrue
baddadmadpadbadadb
worddictionarysearchb
addwordword
worddictionaryaddwordbad
worddictionarysearchad
worddictionaryaddworddad
addword
worddictionarysearchbad
x-matrix
eraseint
kalinin
red-black
httpsenwikipediaorgwikiskiplist
cc
ologn
artyom
treap
commons
skiplist
idea
304050607090
by-sa
skiplists
comparatively
fine
comparing
wikimedia
dinnerplatesint
dinnerplates
popatstackint
favoritei
seating
invited
capable
organizing
wrote
seperate
commas
revisit
citybi
cityai
loop
chunked
sleft
sright
diagaram
indicated
encodedtext
accessed
depict
pr
originaltext
slanted
transposition
matchstick
matchsticks
matchsticksi
detonated
bomb
felt
detonate
bombs
bombsi
xvalue
descent
smooth
exempted
asdfghjkl
american
zxcvbnm
qwertyuiop
accepterid
requesterid
requestaccepted
acceptdate
nim
heap
genre
boring
description
bowling
player2
hit
2xi
pins
player1
sweltering
numsindexi
0144567
4567014
exits
spent
outtime
intime
1440
eventday
pizzas
passingfeesj
passingfees
fees
slant
abcabc
arrangements
columnnumber
role
usersid
cancellation
driverid
2013-10-03
clientid
cancelledbyclient
2013-10-01
unbanned
client
cancelledbydriver
cityid
requestat
canceled
boomerangs
tuple
matters
quadtree2
logical
quadtree1
matrixes
sqrt2
efficiency
efficiencyi
engineers
operand
polish
original0
derivedi
originali
serializes
clarification
approaches
creative
-255
ns
763
-55
numsindex1
numsindexk
indexk
numsindex2
expressible
override
joinedarray
0120
001112
getintervals
summarize
summary
seen
summaryranges
changedate
2019-08-16
newprice
107
commute
trains
depart
suddenly
consumed
mileage
additionaltank
injection
maintank
km
tanks
128
self-dividing
ray
receptor
mirrors
southwest
receptors
nestedinteger
logically
richer
answerx
richeri
quieti
quietness
quiety
quiet
rightchildi
leftchildi
zero-based
numsnumsi
sslength
s0
illegal
goods
rid
conductor
cashbacki
html
ampersand
apos
frasl
entity
quot
entities
lt
amp
gt
seqi
seqlength
hamsters
hamstersi
hamster
unmarked
defeat
energyi
initialenergy
initialexperience
defeating
opponent
experiencei
scoring
alicearrows
numarrows
bk
ak
shoots
archery
bobarrows
8-directionally
nums2k
nums1i2
nums1k
reserved
four-person
reservedseats
exceptional
38
aisle
reservedseatsi
hashmap
myhashmap
underneath
excavate
r1i
c2i
uncovered
artifactsi
c1i
buried
r2i
digi
mud
dig
artifact
artifacts
early
splicing
rulevalue
namei
rulekey
k-beauty
nummoves
reservation
reserves
seatnumber
seatmanager
unreserves
seatmanagerint
manage
reserve
smallest-numbered
fetches
unreserveint
unreserved
childrens
evaluations
autoincrement
commonly
pricesj
turbulent
comparison
backspace
backspacing
editors
similarity
though
arts
rats
tars
302548
3025423482
30254
productofnumbersadd8
productofnumbers
overflowing
getproductint
productofnumbersadd2
productofnumbersadd5
productofnumbersgetproduct2
3025
productofnumbersaddaddaddaddaddgetproductgetproductgetproductaddgetproduct
productofnumbersgetproduct3
302
productofnumbersadd0
productofnumbersadd4
getproduct
productofnumbersadd3
productofnumbersgetproduct4
nullnullnullnullnullnull20400null32
11001
minheightsi
maxheightsi1
heightsi2
heightsj
heightsj-1
cardsi
checkin
underground
startstation
railway
endstation
stationname
undergroundsystem
checkinint
chronological
checkout
getaveragetime
checkoutint
getaveragetimestring
tasksj
serversi
priorities
translated
translation
img1
img2
translate
losers
rcenter
ccenter
detectsquares
perpendicular
last-in-first-out
lifo
queues
mystack
carpet
84351
2314
primefactors
preceded
1e5
couple
switch
couples
twos
voyage
stated
c-137
earth
discovered
universe
morty
magnetic
invented
rick
5489355412
5489355421
care
5489355214
wonderful
5489355142
5489355241
smallest-valued
productkey
interpret
al
interpretation
parsers
belt
shipped
load
conveyor
36
yy
abbxxxxzyy
n3
lfucache
maintained
lfucacheint
lfu
invalidated
recipes
ingredientsi
recipe
recipesi
supplies
tripletsj
max3
maxbi
maxci
maxai
tripletsi
max2
max5
incidenta
answersj
answerslength
2143
4321
4123
candidate
differently
bobvaluesi
alicevaluesi
alicevalues
bobvalues
wraps
needle
haystack
raised
tiling
tromino
tilings
gaini
altitude
altitudes
biker
mutations
mutation
investigate
8-character
gene
startgene
aaccggta
aaccggtt
endgene
annual
expectedi
neighborhood
neighborhoods
12233211
revealing
char
clickr
minesweeper
clickc
click
childi
descriptions
islefti
descriptionsi
cherry
thorn
alike
14312
1412
ticketsi
queuing
fewest
reverses
patterni
salaryi
summing
finalsum
overwriting
digitsumx
minsum
buzz
fizz
fizzbuzz
cancelfn
args
unmodified
modifications
001101
official
inspection
variety
agex
ages
agesi
agey
balancei
banklong
popular
automate
account2
transferint
account1
withdrawn
blength
repeatlimit
minalength
repeatlimitedstring
understand
searchcost
absx1
absy1
decrypt
encrypter
encryptstring
carried
encrypted
encrypt
decryptstring
encryption
encrypterchar
decrypted
encrypts
decryption
giving
kid
extracandies
kids
namely
battery
batteriesi
recharged
batteries
valuediff
indexdiff
toeplitz
k-booking
mycalendarthree
a-z
decoding
11106
grouping
aajf
kjf
boat
boats
interview
acosti
bcosti
flying
fly
exercises
delightful
soul
sound
cool
eetcode
leaveint
sits
examroomint
examroom
unfairness
cookiesi
beforeitemsi
collided
motion
involved
directionsi
nonempty
pk
outermost
decomposition
primitive
rand10
argument
rand7
4616
gcds
0110
numsmiddleindex2
numsmiddleindex-1
middleindex
numsmiddleindex1
unreachable
positioni1
unite
slowest
carsi
falses
trues
confuse
ts
maximizing
truefalse
answerkeyi
answerkey
highest-rated
foodratings
foodsi
ratings
cuisine
newrating
ratingsi
changeratingstring
highestratedstring
cuisinesi
foodratingsstring
cuisines
escaped
backslash
forget
discovering
discovers
non-prime
minlength
maxdoubles
p3
angles
p4
emitting
callbacks
emit
referentially
enables
listeners
eventemitter
dom
nodejs
subscribing
subscribe
emitted
unsubscribe
subscribed
subscriptions
draws
outcomes
maxpts
loosely
probabilities
plays
fib
factorialn
fibn
4566701244
0124445667
declined
approved
transdate
on2
20010db885a38a2e037j7334
x1x2x3x4
ipv6
queryip
192168100
x1x2x3x4x5x6x7x8
ipv4
20010db885a3000000008a2e03707334
192168011
2001db885a3008a2e03707334
020010db885a3000000008a2e03707334
xilength
19216810
specialroads
specialroadsi
x2i
x1i
y2i
startx
targetx
targety
starty
y1i
shiftsi-1
shiftc
shiftx
mousejump
catjump
ccatmmouse
dfs
depth-first
rangefreqqueryint
rangefreqquery
skills
skill
chemistry
skilli
0090
9089
0090089
089
options
dva
dv
refuel
mile
refueling
transferring
stationsi
startfuel
fueli
numsdivide
growtime
planttime
blooming
planttimei
growth
bloomed
seeds
blooms
growtimei
0111001
reverseinvertsi
reversex
inverts
011100110110001
invertx
s4
lo
distancethreshold
no-adjacent-flowers
flowerbed
stages
basically
validated
executes
well-spaced
site
60-second
tweetname
1010000
36107209
tweet3
recordtweet
3600-second
nullnullnullnull221null4
tweetcountsrecordtweetrecordtweetrecordtweetgettweetcountsperfrequencygettweetcountsperfrequencyrecordtweetgettweetcountsperfrequency
0210
tweetcountsgettweetcountsperfrequencyminute
70129
tweetcountsgettweetcountsperfrequencyhour
gettweetcountsperfrequencystring
analyzing
frequencys
tweetcountsrecordtweettweet3
tweet30tweet360tweet310minutetweet3059minutetweet3060tweet3120hourtweet30210
103609
gettweetcountsperfrequency
6060
059
130189
1069
721010000
tweetcounts
analysis
997010000
86400-second
freq
recordtweetstring
indexth
mylinkedlist
deleteatindexint
prev
pointerreference
addatheadint
addattailint
addatindexint
minh
mhts
-ab
ba-c
ab-
hyphens
afad
hyphen
wheels
wheel
codes
wrap
deadends
horizontallyvertically
isnt
tokensi
gaining
anticlockwise
fallout
freedom
trail
spelled
1200
keyword
engraved
rings
stage
purpose
quest
door
pressing
auxiliary
z0
z1
zk
zi
zi1
distancetolastnodex
z2
distancetolastnodezi1
distancetolastnodezi
xn-1
xn-2
permn
imaginary
-100
realimaginaryi
multiplications
complex
sessiontime
sessions
odd-valued
removequeriesi
removequeries
arrk1
arrk0
clock-wise
arrkn
fk
reindexing
4253
friendsi
general
watched
watchedvideos
watchedvideosi
wisely
bolded
str
abcabcabc
abdbec
n1
lengthwordi
lengthwordj
golf
purchase
k-diff
remembers
belonged
higheri
loweri
boxtypesi
numberofboxesi
trucksize
numberofunitsperboxi
boxtypes
space-delimited
identifiers
identifier
letter-logs
digit-logs
six-letter-long
masterguessword
bruteforce
allowedguesses
helper
reasonable
took
masterguess
majoritycheckerint
majoritychecker
stars
non-star
schedule
difficulties
jobdifficultyi
jobdifficulty
dependent
interleaving
tm
t3
nums-1
peaks
winneri
defeated
loseri
matchesi
explode
python
exponent
university
grades
arraylast
extremely
minnumsi
wizards
ruler
wizard
strengthi
army
pattern1
pattern0
license
maxheighti
veganfriendly
restaurantsi
filters
veganfriendlyi
maxprice
579
123456579
flength
2d-array
appearing
sqrt
0001
1111
2p
0011
faced
puzzlesi
beefed
abcdefg
baggage
cabbage
therere
header
fooditemi
ordersicustomernameitablenumberifooditemi
tablenumberi
customernamei
beautyi
-5
carefully
ballsi
rounds0
sectors
sector
rounds1
roundsi
circulate
marathon
pure
venture
soon
capitali
ipo
profitsi
contradiction
dj
dayi
stockpricesi
chart
stockprices
plotting
compression
a2bc3
c3
aabccc
homogenous
accommodate
arraywrapper
features
comma
12344
14234
expiry
renews
unexpired
renewed
countunexpiredtokens
authentication
currenttime
generatestring
renewstring
authenticationmanager
expiration
countunexpiredtokensint
expire
authenticationmanagerint
tokenid
expires
renew
timetolive
advantage
indexs
intersections
10-6
minima
mindistance
maximaminima
maxima
capitalized
capitalize
endtime2
event2
endtime1
starttime1
starttime2
event1
shifted
reshaped
reshape
wanted
handy
row-traversing
matlab
closer
advice
noticed
doctor
candytype
advised
candytypei
selects
traverses
nodeleft
noderight
preserve
accountsi
accountsi0
neccesarilly
secondword
firstword
021
targetword
secretly
rumor
town
trust
trusts
trusti
ensures
enjoy
coffee
enjoyyourcoffee
bval
aval
classs
superclass
cubic
cube
storeroom
circularly
traversing-order
bulb
toggle
got
sortedarr
sortedarray
mountainarraygetk
submissions
circumvent
mountainarraylength
mountainarrgetindex
mountainarr
interactive
disqualification
mountainarrayget
mountainarray
maximumbit
2maximumbit
pricereward
cash
reward
gate
sendersi
messagesi
sender
chat
senders
1921681312
0011255245
012201
nullnullnullnullfacebookcomgooglecomfacebookcomnulllinkedincomgooglecomleetcodecom
googlecom
browserhistoryforward1
browserhistoryback7
browserhistoryvisitgooglecom
homepage
youtubecom
browserhistoryvisitfacebookcom
visitstring
clears
browserhistoryvisitvisitvisitbackbackforwardvisitforwardbackback
browserhistoryleetcodecom
browser
facebookcom
browserhistoryback1
browserhistoryvisitlinkedincom
backint
linkedincom
browserhistory
forwardint
homepagelength
forwarding
browserhistoryvisityoutubecom
urllength
leetcodecomgooglecomfacebookcomyoutubecom111linkedincom227
browserhistorystring
browserhistoryback2
5000
browserhistoryforward2
approach
left-justified
pack
justified
maxwidth
greedy
orthogonal
illustrated
idkey
concatentating
osinsert1
osinsert5
valuelength
eeeee
bbbbb
orderedstreamint
osinsert3
ddddd
orderedstream
aaaaa
osinsert2
ccccc
osinsert4
orderedstream5
forgotten
adjacentpairs
adjacentpairsi
bstiterator
non-existent
initializing
bstiteratortreenode
lllll
hellooo
oo
helloo
hiiii
heeellooo
ooo
stretchy
helllllooo
feeling
l1
ln
l0
l2
pillow
commands
-y
representative
representatives
bth
list1s
ath
halve
non-adjacent
1021
hourglass
unidirectional
digital
follower
followers
551
1351315
beans
bean
pawns
pawn
captures
prepares
waits
prepare
groupsize
handi
presented
-7
wiggle
refereeid
referred
consisiting
sentence2
jane
sentence1
appearance
substituted
substitution
basic
sumnumsi-numsj
positives
20000
category
accountid
50000
monthly
msts
pseudo-critical
mst
transformations
morse
international
searched
kj
queuej
queue0
hj
sub-tree
tour
directly-linked
thievery
thief
243801
243803
801
243
803
nums2index
tot
findsumpairs
findsumpairsint
joinab
stri
joinstri
words0
joinwordsi
str0
joinx
strn
bottoms
topsi
bottomsi
tops
xcentre
2d-map
ycentre
type-2
type-1
cheating
classroom
mappingi
cyclically
uniqueid
employeeuni
travelleddistance
133
discard
satisfaction
dishes
like-time
satisfactioni
preparation
dish
prepared
numsi0
numsi2
abaca
aca
ca
subrectangle
row2col2
updatesubrectangleint
newvalue
getvalueint
rowcol
subrectanglequeries
row1col1
sticker
stickers
grows
applesi
daysi
rot
x22
y22
dec
dd
jun
sep
2100
yyyy
nov
apr
1900
jul
30th
oct
feb
jan
aug
mar
31st
taller
49
1549
deliciousness
meal
meals
deliciousnessi
indiceslength
heightmap
sex
temporary
tables
maxchoosableinteger
desiredtotal
pool
re-use
abssum
t50ms
t100ms
promiseresolve
cancellabletasks
settimeoutcancel
cancellable
promisecatchconsolelog
resolve2
caught
settimeoutresolve
yielded
responsibility
rejects
cmove
rmove
rects
rectsi
rowconditionsi
belowi
colconditions
colconditionsi
abovei
rowconditions
cdefghijklmn
arbitrarily
abcdefghijklmnop
ab121p
spellsi
potionsj
spells
potion
potions
indices0-indexed
buys
tilt
separately
pos1y
pos2v
pos1z
pos1v
pos2x
pos2y
pos1x
pos2z
solitaire
maze
exit
entrancecol
entrancerow
pseudo-palindromic
size1
size2
11110xxx
10xxxxxx
utf8
1-byte
unicode
utf-8
1110xxxx
bytes
byte
octet
0xxxxxxx
translates
110xxxxx
n-bytes
getbillint
productj
productsi
paying
groceries
supermarket
purchased
subtotal
cashierint
frequented
bill
amountj
cashier
horizontalcutsi
verticalcutsj
cake
horizontalcuts
verticalcuts
hasapple
hasapplei
column-wise
baaba0
baaabb0
ans0
ans1
1end2
endtimestamp
functionidstart
0start3
birthi
alive
deathi
customernumber
ordernumber
prefi
upright
purposes
expends
dominoesi
fallen
forces
lazy
guessesj
says
guessint
pre-defined
111
fifth
10111
colorful
rope
neededtimei
neededtime
numerator
enclose
operationsi
baseball
act
processingtimei
enqueuetimei
fills
numbercontainers
changeint
whitespaces
exponentiation
raises
serves
multiplies
subtracts
getresult
chaining
scoresi
basket2
minbasket1ibasket2j
basket1
createcounter
nesting
flattening
arrayflat
px
153
sumnums0numsi
runningsumi
querying
scenic
sortracker
invoked
addstring
queried
invocation
attractiveness
tracker
kthlargestint
kthlargest
abe
position-one
voter
voters
welded
steel
rods
installation
weld
billboard
imageij
sr
sc
imagesrsc
pixel
recentcounter
3000
ping
pingint
revenue
janfebmaraprmayjunjulaugsepoctnovdec
jobsi
devise
visitdate
stadium
2-9
telephone
resrc
2height1
resr1c2height-r-1
res0n-12
resr1c-2height-r-1
y-coordinates
xend
xstart
stretches
spherical
y-direction
taped
flat
pyramidal
farmer
apex
bottommost
fertile
barren
randomizedset
customstackint
customstack
pops
incint
3627
0316227
alien
surprisingly
deviation
1232
2234
conver
maxarr0i
converi
encounters
yielding
a4
saying
countandsayn
countandsay1
countandsayn-1
count-and-say
3322251
floork
complementary
airplane
mynumbers
fascinating
121
121371
joining
371
discussleetcodecom
9001
count-paired
subdomain
com
implicitly
domains
d1d2d3
rep
subdomains
cpdomains
d1d2
out-of-order
3a
encodedstring
kencodedstring
divisions
ababc
camera
cameras
mid
a123bc34d8ef34
operands
non-repeating
multilevel
single-level
currnext
1112131415
11231415
nums1leftright
sumnums1
1121345
sumarr
sumnums2
nums2leftright
cast
topvotedcandidate
topvotedcandidateint
qint
personsi
election
super-palindrome
super-palindromes
highest-ranked
pricing
graph1
hole
grapha
1-dimensional
numzeroes
-1s
numnegones
numones
numzeros
peekingiterator
peekingiteratoriteratorint
x1y1x2y2xnyn
x1x2xny1y2yn
findmedian
medianfinder
bobsizes
bobsizesj
alicesizes
alicesizesi
planes
looking
shadow
zx
3-dimensional
projection
projections
view
yz
retrieving
getmin
minstack
tags
unmatched
cdatacontent
issue
cdata
unbalanced
wrapped
tagcontent
parsed
forbid
validator
snippet
note1
cdatacdatacontent
tagnametagcontenttagname
tagname
parse
tag
integer-sided
tape
distance3
distance1
distance2
distance0
self-edges
bipartite
graphu
graphv
gray
n-bit
dividend
-27335
quotient
truncated
dealing
8345
lowlimit
highlimit
silver
athletes
scorei
bronze
medal
athlete
nearly
curs
cur
totaltrips
influence
successively
newflowers
caretaker
lat
2015
policyholders
lon
2016
policy
holders
tiv2016
tiv2015
investment
insurance
policyholder
latitude
longitude
110100010
areas
4-length
m-1
four-directionally
organized
forested
hectare
hectares
matrixxy
irrelevant
magnitude
subdivide
maxmoves
xcnti
cnti
xcnti-1
walks
non-obstacle
4-directional
pathi
terminates
respecting
seeding
destroy
flow
heightsrc
lot
pacific
ocean
atlantic
oceans
aaaeeeooo
uaeio
aaaaaaeiiiioou
aeoiu
es
aeiou
durationi
3245
2582
blocksi
recolor
sij
sxy
reveal
ethernet
cables
formulas
h1o2
h2o2he3mg4
h2o2
h2o23
atomic
h2o
atom
chemical
12321
slower
catches
slow
fleets
bumper
bookmyshowint
hence
hall
scatterint
picky
gatherint
bookmyshow
book
vary
allocates
maxrow
spectators
ticketing
concert
columntitle
battleships
separates
battleship
reflexivity
acd
s2i
symmetry
implies
eed
transitivity
equivalency
equivalence
basestr
convertstring
legibility
pahnaplsiigyir
font
paypalishiring
decstring
getminkey
getmaxkey
incstring
allone
angle
holes
permuted
itembrand
joindate
buyer
favoritebrand
shopping
itemid
specialin
needsi
specialij
offer
0-59
led
watch
pm
451
leds
0-11
turnedon
1002
bba
bbabba
bababcba
newinterval
chips
chip
transitive
friendship
teach
friendshipsi
languagesi
friendships
rectanglei
yi1
yi2
leaf-similar
decision
brainpoweri
questionsi
examinations
subjects
subjectname
subject
studentid
studentname
attended
n-digits
endi-1
pairslength
querycharactersi
querycharacters
lengthsi
queryindicesi
queryindices
fn-2
k-similar
mls
ml
soup
northwest
grids
southeast
cstart
rstart
garbagei
traveli
assortment
garbage
trucks
responsible
timeseries
timer
poisoned
poison
hero
enemy
attacks
timeseriesi
ashe
teemo
exception
qualityi
expectation
wage
wagei
39916800
convention
f11
taxes
percent1
percenti
tax
upper0
earned
percent0
upper1
upperi
bracketslength
percent2
upperi-1
taxed
bracketsi
upper2
even-valued
grandparent
bcad
wordb
abac
word3
predecessor
cba
wordk
worda
grayscale
surrounding
rounding
smoother
img
043
comprising
rocks
rocksi
capacityi
additionalrocks
version1
specify
2533
version2
revisions
revision
sub-nodes
sub-node
minrootleftval
rootrightval
changenumi
mutating
third-largest
122
distinctly
second-largest
defending
eliminate
monster
chargethe
weapon
monsters
blacklist
blacklisted
ramp
throneinheritance
born
older
successorxs
successorx
birthstring
kingname
successorking
deathstring
childname
getinheritanceorder
whos
successorbob
oldest
successorjack
well-defined
son
inheritance
curorder
throneinheritancestring
parentname
gave
grandchildren
successoralice
jack
blockedi
boards
stuck
redirects
redirect
150
firsti
secondi
xored
arri-1
gender
provides
old
canonical
unix-style
slashes
matrixrowcol
cnumselect
numselect
nums20
nums11
nums1n
nums10
nums2n
nums21
poorquerypercentage
queryname
database
fixed-bound
maxk
mink
dailycapi
favoritedayi
candiescounti
candiescount
favoritetypei
almost
server-to-server
querytime
lays
homework
scramble
scrambled
3001
1100
deci-binary
112
30000
aabd
wordin-1
lcp
lcpij
wordjn-1
aaca
unvisited
gridrowjcolj
answering
lamps
illuminated
illuminates
lampsi
lamp
preferences
prefers
preference
unhappy
preferencesi
bn
minai
actor
actordirector
cooperated
actorid
director
directorid
abs
cuboid
lengthj
lengthi
cuboidsi
widthj
cuboids
heightj
3x3
bij
maxbik
numsij
sized
nottobeval
helps
tobeval
expect
developers
rabbits
rabbit
magazine
ransomnote
diffi
subtracted
particularly
numexchange
drinking
drink
bottle
bottles
numbottles
rev123
revx
revnumsi
revnumsj
rev120
max15
44
max6
dividers
divider
corridor
decorative
uni-valued
lx
xr
xl
rxxlrxrxl
dress
dresses
washing
companies
favoritecompaniesi
favoritecompanies
favorites
addbackint
smallestinfiniteset
popsmallest
numsliri
52372
endlessly
loops
uploadint
uploaded
luprefix
upload
luprefixint
uploads
up-left
bottomrightrc
answerrc
topleftrc
nextlargest
yesterday
weather
recorddate
61741
6141
odd-indexed
even-indexed
6174
6741
stonesj
dcce
fw
fqueriesi
randomizedcollection
linearly
multiset
wrap-around
cith
rith
flooded
valiant
imprisoned
fight
laid
orbs
rescue
quickly
princess
health
decides
dungeon
power-ups
knights
threats
demons
seq1
seqk
forwardbackward
numsseqj
seq0
2266622
transmission
pressedkeys
texting
robbing
jug2capacity
jug
measure
targetcapacity
measurable
jug1capacity
pour
jugs
peoples
requestsj
resultj
patches
addpatch
sorts
3214
k-values
pancake
arr0k-1
averageamount
analyze
visitedon
fisher
fish
abaacc
xayb
non-bull
cows
hint
ask
bulls
irreducible
compile
createhelloworld
1-day
planned
costs0
365
7-day
costs1
costs2
30-day
trio
trios
abefh
singleton
rexpr
rw
acefg
abdfh
acefh
rabcd
ra
abdfg
understood
union
concatenations
abefg
grammar
acadbcbd
comma-delimited
rabcdefgh
ek
acdfg
acdfh
re2
rabc
rabbc
re1
arrlefti
arrrighti
situated
stayed
fire
safehouse
safely
grass
groupby
arraygroupbyfn
acceptable
originating
patience
resend
newly
patiencei
replies
periodically
channel
elapsed
resending
channels
floornumsi
triangulate
convex
polygon
triangulation
n-sided
truncating
newi
mappings
mappingsi
oldi
0032
clamp
atoi
myatoistring
ccs
clamped
mechanic
mechanics
garage
painter
painters
paints
2k
tleft
tright
appeal
abbca
successors
p123m
iquerieslength-1
rungs
rung
jewels
processingtime
activitytype
processid
activities
machineid
heaviest
divisorsi
vacant
prison
barcodesi
barcode
barcodes
minjump
maxjump
y0
10n
cutsi
rj
op2
op3
op1
conventions
negation
adhere
traversals
inner
rolling
sided
heater
winter
contest
warmed
heaters
repetitively
lenarr
arry
arrx
fint
customfunction
findsolution
monotonically
callable
fxy
implementations
functionid
src2
src1
constituent
lastly
dest
qj
edgelisti
pj
disi
edgelist
pending
strict
farm
fix
changetime
numlaps
tiresi
rix-1
laps
race
tires
lap
tire
shuffle
-1073741825
pointsj
countj
rather
57
mixj
rightj
47
segmentsi
leftj
paintingj
246
mix
145177
thin
1412477
factorial10
clumsy10
clumsy
recyclable
fat
lowfats
time-points
removerangeint
module
overlaps
tracking
queryrangeint
addrangeint
tracked
rangemodule
1e-5
succprobi
identity
hx
gx
fnx
fghx
exclusively
cornered
defense
defensei
propertiesi
attacki
defensej
attackj
items2
ret
reti
items1
enrolled
store2
store3
store1
reordering
findelements
findelementstreenode
recovered
treenodeleftval
treenodeleft
recovers
treenodeval
treenoderight
treenoderightval
interesting
numwanted
uselimit
isconnected
province
provinces
isconnectedij
removable
sremovablei
removablelength
secrets
firstperson
modes
occurred
infection
cabxbae
cxbae
cabxe
numslots
excess
100th
champagne
glasses
poured
pictured
pouring
matchings
playersi
trainersj
trainers
trainer
12c
abccdef
cbca
insensitive
caaacab
licenseplate
bbcbaa
attain
aecdb
aacabb
bs
hitsi
erasures
stable
erasure
reformatting
formatting
firstly
bigger
heshe
powersj
2019-03-31
saledate
2019-01-01
unitprice
ryan
subsequence2
subsequence1
piecesi
c-1
r-1
soldier
ratingk
ratingj
346
workerj
pays
difficultyi
k-mirror
base-10
2-mirror
contrary
base-2
base-k
necesssarily
comprised
chalk
chalki
restart
subgrids
prefixi
18291174312
21347112918
effective
control
implicit
newline
macros
comment
comments
secondlen
firstlen
reside
season
achievable
decodestring
httpsleetcodecomproblemsdesign-tinyurl
encodedecode
tiny
companion
shorturl
tinyurl
longurl
shortening
encodestring
httptinyurlcom4e9iak
ministry
reorienting
transport
narrow
orient
pi1
0122n
p2n
maxvalue
searchstring
trie
dataset
startswithstring
autocomplete
pronounced
paragraph
10921
even-numbered
non-horizontal
crossing
assumes
segmented
-23
-22
-20
016666666
212
repeatingpart
1230001
integerpartnonrepeatingpartrepeatingpart
016666
123001212
conventionally
016
portion
nonrepeatingpart
integerpart
integerpartnonrepeatingpart
leads
terminal
unitssold
enddate
averageprice
startdate
purchasedate
solutiondouble
randpoint
ps
typically
456-7890
xxx-xxx-xxxx
one-liner
7890
987-123-4567
xxx-xxxx
xxx
threatens
isinfectedij
isinfected
affected
rapidly
quarantine
virus
modeled
style
destinations
boardn
mincurr
-14-13
boustrophedon
milestonesi
weeks
milestone
milestones
violate
visitid
mall
transactionid
hashvalue
hashsub
valsk-1
vals1
pk-1
vals0
hashs
vala
valz
playlist
boredom
music
playlists
listen
introduced
rollmax
rollmaxi
simulator
relaxation
beautifully
trimming
rejected
prioritizes
600
handed
withdrawing
deposits
banknotescount
banknote
200
banknotes
300
atm
employeesiimportance
employeesisubordinates
employeesiid
fractions
less-than-or-equal-to
minb
ocurrences
bx
subfolder
subfolders
bw
bz
ax
axy
bxy
underlying
onetwothree
az
mirror
symmetric
alex
xk
tomatoslices
totalsmall
jumbo
burgers
tomato
totaljumbo
cheeseslices
burger
compatibility
survey
mentors
achieved
student-mentor
mentorsj
mentor
studentsi
leavetimei
mistake
123450
climbing
marbles
marble
weightsj
numsi-1
references
multiples
normalized
81
finger
microwave
fatigue
54
99
startat
cooking
generic
